//=============================================================================
/// @file
/// プログラムメイン実装ファイル
///
/// プログラムメイン実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma managed(push, off)

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "program/program.h"
#include <locale.h>
#include <io.h>
#include <fcntl.h>

//=============================================================================
// 無名名前空間
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    HINSTANCE s_hInstance{}; ///< インスタンスハンドル
}

//=============================================================================
// プログラム名前空間
//-----------------------------------------------------------------------------
namespace program {
    //=========================================================================
    // プログラムクラス
    //-------------------------------------------------------------------------
    // 静的公開関数
    //-------------------------------------------------------------------------
    // メイン関数
    bool Program::Main(HINSTANCE hInstance) noexcept {
        // 処理ブロック
        bool result{true};
        do {
            // インスタンスハンドル取得
            s_hInstance = hInstance;
            // 漢字出力
            ::setlocale(LC_ALL, "");
            ::_setmode(_fileno(stdout), _O_U8TEXT);
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"%ls：メイン関数\n", Program::GetObjectName());
            // モジュールファイルパス取得
            wchar_t buffer[MAX_PATH]{};
            ::GetModuleFileNameW(s_hInstance, buffer, sizeof buffer/sizeof buffer[0]);
            // プログラム情報出力
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"プロジェクト名：%ls\n", PROJECT_NAME);
            ::wprintf(L"ターゲット名：%ls\n", TARGET_NAME);
            ::wprintf(L"名前空間名：%ls\n", program::GetNameSpaceName());
            ::wprintf(L"クラス名：%ls\n", Program::GetObjectName());
            ::wprintf(L"文字セット：%ls\n", CHAR_SET_NAME);
            ::wprintf(L"プラットフォーム：%ls\n", PLATFORM_NAME);
            ::wprintf(L"構成：%ls\n", BUILD_TYPE);
            ::wprintf(L"構成の種類：%ls\n", CONFIG_NAME);
            ::wprintf(L"ターゲット種別：%ls\n", TARGET_TYPE);
            ::wprintf(L"プロジェクトディレクトリ：%ls\n", PROJECT_DIR);
            ::wprintf(L"モジュールファイルパス：%ls\n", buffer);
        } while (false);

        // 実行結果
        return result;
    }
}

#pragma managed(pop)
