//=============================================================================
/// @file
/// テストアプリケーション実装ファイル
///
/// テストアプリケーション実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma managed(push, off)

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "app_test/core/app_test.h"
#include "app_test/core/app_test_sub.h"
#include "app_test/res_app_test.h"
#include "lib_common/core/lib_common.h"
#include "lib_common/core/lib_common_sub.h"
#include "lib_common/res_lib_common.h"
#include <locale.h>
#include <io.h>
#include <fcntl.h>
#include <iostream>

//=============================================================================
// C言語インクルードファイル
//-----------------------------------------------------------------------------
extern "C" {
#include "app_test/core/app_test_c.h"
}

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#include "app_test/core/app_test.hpp"

//=============================================================================
// 無名名前空間
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    HINSTANCE s_hInstance{}; ///< インスタンスハンドル
}

//=============================================================================
// プログラム名前空間
//-----------------------------------------------------------------------------
namespace program {
    //=========================================================================
    // プログラムクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    // メイン関数
    bool Program::Main(HINSTANCE hInstance) noexcept {
        // 処理ブロック
        bool result{};
        do {
            // インスタンスハンドル取得
            s_hInstance = hInstance;
            // 漢字出力
            ::setlocale(LC_ALL, "");
            ::_setmode(_fileno(stdout), _O_U8TEXT);
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"プログラムクラス：メイン関数\n");
            // モジュールファイルパス取得
            wchar_t buffer[MAX_PATH]{};
            ::GetModuleFileNameW(s_hInstance, buffer, sizeof buffer/sizeof buffer[0]);
            // プログラム情報出力
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"プロジェクト名：%ls\n", PROJECT_NAME);
            ::wprintf(L"ターゲット名：%ls\n", TARGET_NAME);
            ::wprintf(L"名前空間名：%ls\n", app_test::GetNameSpaceName());
            ::wprintf(L"クラス名：%ls\n", AppTest::GetObjectName());
            ::wprintf(L"文字セット：%ls\n", CHAR_SET_NAME);
            ::wprintf(L"プラットフォーム：%ls\n", PLATFORM_NAME);
            ::wprintf(L"構成：%ls\n", BUILD_TYPE);
            ::wprintf(L"構成の種類：%ls\n", CONFIG_NAME);
            ::wprintf(L"ターゲット種別：%ls\n", TARGET_TYPE);
            ::wprintf(L"プロジェクトディレクトリ：%ls\n", PROJECT_DIR);
            ::wprintf(L"モジュールファイルパス：%ls\n", buffer);
            // サブ関数
            FuncAppTestSub();
            // C言語関数
            FuncAppTestC();
            // 共通ライブラリクラスインスタンス取得
            LibCommon::GetInstance();
            // テストアプリケーションクラスインスタンス取得
            app_test::AppTest::GetInstance();
        } while (false);

        // 実行結果
        return result;
    }
}

//=============================================================================
// テストアプリケーション名前空間
//-----------------------------------------------------------------------------
namespace app_test {
    //=========================================================================
    // グローバル関数
    //-------------------------------------------------------------------------
    // ターゲット種別取得関数
    wchar_t const*  GetTargetType() noexcept {
        // 処理ブロック
        wchar_t const* result{};
        do {
            // ターゲット種別文字列取得
            result = TARGET_TYPE;
        } while (false);

        // 実行結果
        return result;
    }

    //-------------------------------------------------------------------------
    // 名前空間名取得関数
    wchar_t const* GetNameSpaceName() noexcept {
        // 処理ブロック
        wchar_t const* result{};
        do {
            // 名前空間名取得
            result = L"テストアプリケーション名前空間";
        } while (false);

        // 実行結果
        return result;
    }

    //=========================================================================
    // テストアプリケーションクラス
    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    /// インスタンス取得関数
    ///
    /// インスタンス取得関数です。
    ///
    /// @param     なし
    /// @return    テストアプリケーションクラスインスタンス参照
    /// @attention なし
    //---------------------------------------------------------------------
    AppTest& AppTest::GetInstance() noexcept {
        static AppTest s_cInstance; ///< テストアプリケーションクラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    AppTest::AppTest() noexcept {
        ::wprintf(L"-------------------------------------------------------------------------------\n");
        ::wprintf(L"%ls：コンストラクタ\n", AppTest::GetObjectName());
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    AppTest::~AppTest() noexcept {
        ::wprintf(L"-------------------------------------------------------------------------------\n");
        ::wprintf(L"%ls：デストラクタ\n", AppTest::GetObjectName());
    }

    //=========================================================================
    // 公開関数
    //-------------------------------------------------------------------------
    // 初期化関数
    bool AppTest::Init() noexcept {
        // 処理ブロック
        bool result{};
        do {
            ::wprintf(L"テストアプリケーションクラス：初期化関数\n");
        } while (false);

        // 実行結果
        return result;
    }

    //-------------------------------------------------------------------------
    // 終了関数
    bool AppTest::Exit() noexcept {
        // 処理ブロック
        bool result{true};
        do {
            ::wprintf(L"テストアプリケーションクラス：終了関数\n");
        } while (false);

        // 実行結果
        return result;
    }
}

#pragma managed(pop)
