//=============================================================================
/// @file
/// 共通ライブラリ実装ファイル
///
/// 共通ライブラリ実装ファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma managed(push, off)

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "lib_common/core/lib_common.h"
#include "lib_common/core/lib_common_sub.h"
#include "lib_common/res_lib_common.h"
#include <locale.h>
#include <io.h>
#include <fcntl.h>

//=============================================================================
// C言語インクルードファイル
//-----------------------------------------------------------------------------
extern "C" {
#include "lib_common/core/lib_common_c.h"
}

//=============================================================================
// インクルード実装ファイル
//-----------------------------------------------------------------------------
#ifndef LIB_COMMON_STATIC
#include "lib_common/core/lib_common.hpp"
#endif

//=============================================================================
// 無名名前空間
//-----------------------------------------------------------------------------
namespace {
    //=========================================================================
    // ファイルスコープローカル変数
    //-------------------------------------------------------------------------
    HINSTANCE s_hInstance{}; ///< インスタンスハンドル
}

//=============================================================================
// グローバル関数
//-----------------------------------------------------------------------------
/// DLL初期化関数
///
/// DLL初期化関数です。
///
/// @param[in] hInstance  DLLモジュールハンドル
/// @param[in] dwReason   関数を呼び出す理由
/// @param[in] lpReserved 予約済み
/// @return    終了コード
/// @attention なし
//-----------------------------------------------------------------------------
BOOL WINAPI DllMain(HINSTANCE hInstance, DWORD dwReason, LPVOID lpReserved) {
    // 処理ブロック
    BOOL result{};
    do {
        // 関数呼び出し理由チェック
        if (DLL_PROCESS_ATTACH == dwReason) {
            // インスタンスハンドル取得
            s_hInstance = hInstance;
            // 漢字出力
            ::setlocale(LC_ALL, "");
            ::_setmode(_fileno(stdout), _O_U8TEXT);
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"共通ライブラリ：アタッチ\n");
        }
        // 関数呼び出し理由チェック
        else if (DLL_PROCESS_DETACH == dwReason) {
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"共通ライブラリ：デタッチ\n");
        }

        // 成功！
        result = true;
   } while (false);

    // 実行結果
    return result;
}

//=============================================================================
// 共通ライブラリ名前空間
//-----------------------------------------------------------------------------
namespace lib_common {
    //=========================================================================
    // グローバル関数
    //-------------------------------------------------------------------------
    // 名前空間名取得関数
    wchar_t const* GetNameSpaceName() noexcept {
        // 処理ブロック
        wchar_t const* result{};
        do {
            // 名前空間名取得
            result = L"共通ライブラリ名前空間";
        } while (false);

        // 実行結果
        return result;
    }

    //-------------------------------------------------------------------------
    // ターゲット種別取得関数
    wchar_t const*  GetTargetType() noexcept {
        // 処理ブロック
        wchar_t const* result{};
        do {
            // ターゲット種別文字列取得
            result = TARGET_TYPE;
        } while (false);

        // 実行結果
        return result;
    }

    //-------------------------------------------------------------------------
    // インスタンスハンドル取得関数
    HINSTANCE GetInstanceHandle() noexcept {
        // 処理ブロック
        HINSTANCE result{};
        do {
            // インスタンスハンドル取得
            result = s_hInstance;
        } while (false);

        // 実行結果
        return result;
    }

    //=========================================================================
    // 静的公開関数
    //-------------------------------------------------------------------------
    /// インスタンス取得関数
    ///
    /// インスタンス取得関数です。
    ///
    /// @param     なし
    /// @return    共通ライブラリクラスインスタンス参照
    /// @attention なし
    //---------------------------------------------------------------------
    LibCommon& LibCommon::GetInstance() noexcept {
        static LibCommon s_cInstance; ///< 共通ライブラリクラスインスタンス
        return s_cInstance;
    }

    //=========================================================================
    // 非公開構築子と解体子
    //-------------------------------------------------------------------------
    // コンストラクタ
    LibCommon::LibCommon() noexcept {
        ::wprintf(L"-------------------------------------------------------------------------------\n");
        ::wprintf(L"%ls：コンストラクタ\n", LibCommon::GetObjectName());
        Init();
    }

    //-------------------------------------------------------------------------
    // デストラクタ
    LibCommon::~LibCommon() noexcept {
        ::wprintf(L"-------------------------------------------------------------------------------\n");
        ::wprintf(L"%ls：デストラクタ\n", LibCommon::GetObjectName());
        Exit();
    }

    //=========================================================================
    // 公開関数
    //-------------------------------------------------------------------------
    // 初期化関数
    bool LibCommon::Init() noexcept {
        // 処理ブロック
        bool result{};
        do {
            // モジュールファイルパス取得
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"共通ライブラリクラス：初期化関数\n");
            // モジュールファイルパス取得
            wchar_t buffer[MAX_PATH]{};
            ::GetModuleFileNameW(s_hInstance, buffer, sizeof buffer/sizeof buffer[0]);
            // ライブラリ情報出力
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"プロジェクト名：%ls\n", PROJECT_NAME);
            ::wprintf(L"ターゲット名：%ls\n", TARGET_NAME);
            ::wprintf(L"名前空間名：%ls\n", lib_common::GetNameSpaceName());
            ::wprintf(L"クラス名：%ls\n", LibCommon::GetObjectName());
            ::wprintf(L"文字セット：%ls\n", CHAR_SET_NAME);
            ::wprintf(L"プラットフォーム：%ls\n", PLATFORM_NAME);
            ::wprintf(L"構成：%ls\n", BUILD_TYPE);
            ::wprintf(L"構成の種類：%ls\n", CONFIG_NAME);
            ::wprintf(L"ターゲット種別：%ls\n", TARGET_TYPE);
            ::wprintf(L"プロジェクトディレクトリ：%ls\n", PROJECT_DIR);
            ::wprintf(L"モジュールファイルパス：%ls\n", buffer);
            // サブ関数
            FuncSub();
            // C言語関数
            FuncLibCommonC();
        } while (false);

        // 実行結果
        return result;
    }

    //-------------------------------------------------------------------------
    // 終了関数
    bool LibCommon::Exit() noexcept {
        // 処理ブロック
        bool result{true};
        do {
            ::wprintf(L"-------------------------------------------------------------------------------\n");
            ::wprintf(L"共通ライブラリクラス：終了関数\n");
        } while (false);

        // 実行結果
        return result;
    }
}

#pragma managed(pop)
