//=============================================================================
/// @file
/// 共通ライブラリ定義ヘッダファイル
///
/// 共通ライブラリ定義ヘッダファイルです。
///
/// @attention なし
//-----------------------------------------------------------------------------

#pragma once
#pragma managed(push, off)

//=============================================================================
// インクルードファイル
//-----------------------------------------------------------------------------
#include "common_def.h"

//=============================================================================
// エクスポート宣言マクロ定義
//-----------------------------------------------------------------------------
#if defined(LIB_COMMON_STATIC)
#   define LIB_COMMON_API                       ///< スタティックライブラリ宣言
#elif defined(LIB_COMMON_EXPORT)
#   define LIB_COMMON_API __declspec(dllexport) ///< ダイナミックライブラリエクスポート宣言
#else
#   define LIB_COMMON_API __declspec(dllimport) ///< ダイナミックライブラリインポート宣言
#endif

//=============================================================================
/// 共通ライブラリ名前空間
///
/// 共通ライブラリ名前空間です。
///
/// @attention なし
//-----------------------------------------------------------------------------
namespace lib_common {}

//=============================================================================
// 名前空間使用宣言
//-----------------------------------------------------------------------------
using namespace lib_common; // 共通ライブラリ名前空間

#pragma managed(pop)
